# MySQL Table Relationships and SQL Concepts: ORDER BY, GROUP BY, MAX, DISTINCT, and COUNT

In [ ]:
# Install necessary packages
%pip install jupyter ipython-sql mysql-connector-python sqlalchemy pymysql prettytable cryptography

# Load the ipython-sql extension
%load_ext sql

# Connect to the postgres database  
%sql mysql+pymysql://root:root@localhost:3308/mydatabase

# Configure ipython-sql to use a valid PrettyTable style
%config SqlMagic.style = '_DEPRECATED_DEFAULT'



## Objectives

1. Understand table relationships:
   - One-to-One
   - One-to-Many
   - Many-to-Many
2. Learn to define and use relationships in MySQL.
3. Use `ORDER BY`, `GROUP BY`, `MAX`, `DISTINCT`, and `COUNT` with practical examples.
4. Combine these concepts for advanced SQL queries.


## Table Schemas and Data

### 1. One-to-One Relationship

**Tables**:
- `users`: Stores user details.
- `user_profiles`: Stores additional user information linked to `users`.

| `users` Table Schema |
|-----------------------|
| `user_id` (INT, PK)  |
| `name` (VARCHAR)     |

| `user_profiles` Table Schema |
|------------------------------|
| `profile_id` (INT, PK)      |
| `user_id` (INT, UNIQUE, FK) |
| `bio` (TEXT)               |

In [ ]:
%%sql
-- Create and populate tables for One-to-One Relationship
CREATE TABLE users (
    user_id INT PRIMARY KEY,
    name VARCHAR(100)
);

CREATE TABLE user_profiles (
    profile_id INT PRIMARY KEY,
    user_id INT UNIQUE, -- Ensure one-to-one
    bio TEXT,
    FOREIGN KEY (user_id) REFERENCES users(user_id)
);

-- Populate tables
INSERT INTO users (user_id, name) VALUES 
(1, 'Alice'),
(2, 'Bob');

INSERT INTO user_profiles (profile_id, user_id, bio) VALUES 
(1, 1, 'Bio of Alice'),
(2, 2, 'Bio of Bob');


### 2. One-to-Many Relationship

**Tables**:
- `departments`: Stores department details.
- `employees`: Stores employee details linked to `departments`.

| `departments` Table Schema |
|----------------------------|
| `department_id` (INT, PK) |
| `name` (VARCHAR)          |

| `employees` Table Schema |
|--------------------------|
| `employee_id` (INT, PK) |
| `name` (VARCHAR)        |
| `department_id` (INT, FK) |

In [ ]:
%%sql
-- Create and populate tables for One-to-Many Relationship
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    name VARCHAR(100)
);

CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    name VARCHAR(100),
    department_id INT,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);

-- Populate tables
INSERT INTO departments (department_id, name) VALUES 
(1, 'HR'),
(2, 'IT');

INSERT INTO employees (employee_id, name, department_id) VALUES 
(1, 'Alice', 1),
(2, 'Bob', 2),
(3, 'Charlie', 1);


### 3. Many-to-Many Relationship

**Tables**:
- `students`: Stores student details.
- `courses`: Stores course details.
- `enrollments`: Stores enrollment details linking `students` and `courses`.

| `students` Table Schema |
|--------------------------|
| `student_id` (INT, PK)  |
| `name` (VARCHAR)        |

| `courses` Table Schema |
|-------------------------|
| `course_id` (INT, PK)  |
| `title` (VARCHAR)      |

| `enrollments` Table Schema |
|-----------------------------|
| `enrollment_id` (INT, PK)  |
| `student_id` (INT, FK)     |
| `course_id` (INT, FK)      |

In [ ]:
%%sql
-- Create and populate tables for Many-to-Many Relationship
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    name VARCHAR(100)
);

CREATE TABLE courses (
    course_id INT PRIMARY KEY,
    title VARCHAR(100)
);

CREATE TABLE enrollments (
    enrollment_id INT PRIMARY KEY,
    student_id INT,
    course_id INT,
    FOREIGN KEY (student_id) REFERENCES students(student_id),
    FOREIGN KEY (course_id) REFERENCES courses(course_id)
);

-- Populate tables
INSERT INTO students (student_id, name) VALUES 
(1, 'Alice'),
(2, 'Bob');

INSERT INTO courses (course_id, title) VALUES 
(1, 'Math'),
(2, 'Science');

INSERT INTO enrollments (enrollment_id, student_id, course_id) VALUES 
(1, 1, 1),
(2, 1, 2),
(3, 2, 1);


## Advanced SQL Concepts with `GROUP BY`, `MAX`, `DISTINCT`, and `COUNT`

In [ ]:
%%sql
-- Find the highest salary by department (One-to-Many)
SELECT d.name AS department, MAX(s.amount) AS highest_salary
FROM departments d
JOIN employees e ON d.department_id = e.department_id
JOIN salaries s ON e.employee_id = s.employee_id
GROUP BY d.name;

In [ ]:
%%sql
-- Find unique employees by salary (DISTINCT)
SELECT DISTINCT e.name, s.amount
FROM employees e
JOIN salaries s ON e.employee_id = s.employee_id;

In [ ]:
%%sql
-- Count employees earning more than 5000
SELECT COUNT(*) AS total_high_earners
FROM salaries
WHERE amount > 5000;

In [ ]:
%%sql
-- Count the number of students enrolled in each course (Many-to-Many)
SELECT c.title AS course, COUNT(e.student_id) AS total_students
FROM courses c
JOIN enrollments e ON c.course_id = e.course_id
GROUP BY c.title;